benchmark_20260118_131028/qjs_cluster_4w_GET_100c__api_users_ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        qjs-express/1.0
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /api/users
Document Length:        31 bytes

Concurrency Level:      100
Time taken for tests:   2.851 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    10000
Total transferred:      2360000 bytes
HTML transferred:       310000 bytes
Requests per second:    3507.58 [#/sec] (mean)
Time per request:       28.510 [ms] (mean)
Time per request:       0.285 [ms] (mean, across all concurrent requests)
Transfer rate:          808.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   8.9      0     127
Processing:     1   27  36.1      1     204
Waiting:        0   27  36.0      1     203
Total:          1   28  37.2      1     204

Percentage of the requests served within a certain time (ms)
  50%      1
  66%     44
  75%     53
  80%     58
  90%     71
  95%    101
  98%    134
  99%    152
 100%    204 (longest request)